Documents/урскВводИзмеренийТМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>урскВводИзмеренийТМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.урскЗначенияПараметровТехническихМест</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТехническоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.урскСтруктурыСети</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзмеренныеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.урскПараметры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.урскПараметры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/урскЗначенияПараметровТехническихМест.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>урскЗначенияПараметровТехническихМест</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.урскПараметры</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТехническоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.урскСтруктурыСети</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.урскПараметры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/урскВводИзмеренийТМ/Ext/ObjectModule.bsl
#Область ОбработкаПроведения 

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.урскЗначенияПараметровТехническихМест.Записывать = Истина;
	Для Каждого ТекСтрокаИзмеренныеПараметры Из ИзмеренныеПараметры Цикл
		Движение = Движения.урскЗначенияПараметровТехническихМест.Добавить();
		Движение.Период = Дата;
		Движение.ТехническоеМесто = ТехническоеМесто;
		Движение.Параметр = ТекСтрокаИзмеренныеПараметры.Параметр;
		Движение.Значение = ТекСтрокаИзмеренныеПараметры.Значение;   
		
	КонецЦикла;
КонецПроцедуры    

#КонецОбласти
